---
kind: method
id: M:Autodesk.Revit.DB.Form.IsEdgeReference(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/a81ed4ec-7bbf-1cb9-4df2-bbefc397395d.htm
---
# Autodesk.Revit.DB.Form.IsEdgeReference Method

**中文**: 对话框、窗口、窗体

Tell if the pick is the reference to an edge of the form.

## Syntax (C#)
```csharp
public bool IsEdgeReference(
	Reference edgeReference
)
```

## Parameters
- **edgeReference** (`Autodesk.Revit.DB.Reference`) - Reference to be checked.